--The standard convention in SQL Server is:
-- PRIMARY KEY:       PK_Tablename
-- FOREIGN KEY:       FK_ForeignKeyTable_PrimaryKeyTable
-- UNIQUE:            UQ_TableName>_ColumnName(s)
-- CHECK CONSTRAINT:  CHK_TableName_ColumnName
-- INDEX:             IX_TableName_Column(s)


USE [krsu_2]

CREATE TABLE [Страны]
( 
  [Код страны] INT NOT NULL IDENTITY(1, 1),
  [Наименование страны] NVARCHAR(30) NOT NULL,
  CONSTRAINT [PK_Страны] PRIMARY KEY ([Код страны])
);



CREATE TABLE [Города]
( 
  [Код города] INT NOT NULL IDENTITY(1, 1),
  [Наименование города] NVARCHAR(30) NOT NULL,
  [Код страны] INT NOT NULL,
  CONSTRAINT [PK_Города] PRIMARY KEY ([Код города]),
  CONSTRAINT [FK_Города_Страны] FOREIGN KEY ([Код страны])
    REFERENCES [dbo].[Страны] ([Код страны])
    ON DELETE CASCADE
    ON UPDATE CASCADE,
  INDEX [IX_Города_НаименованиеГорода_КодСтраны]
    UNIQUE ([Наименование города], [Код страны]),
);



CREATE TABLE [Сотрудники]
( 
  [Код сотрудника] INT NOT NULL IDENTITY(1, 1),
  [Фамилия] NVARCHAR(20),
  [Имя] NVARCHAR(20),
  [Отчество] NVARCHAR(20),
  [Дата рождения] DATE,
  [Отдел] INT,
  [Зарплата] DECIMAL(19, 4),
  [Код города] INT NOT NULL,
  CONSTRAINT [PK_Сотрудники] PRIMARY KEY ([Код сотрудника]),
  CONSTRAINT [CHK_Сотрудники_Зарплата] CHECK ([Зарплата] >= 200),
  CONSTRAINT [FK_Сотрудники_Города] FOREIGN KEY ([Код города])
    REFERENCES [dbo].[Города] ([Код города])
    ON DELETE CASCADE
    ON UPDATE CASCADE
);

ALTER TABLE [dbo].[Сотрудники]
  ADD [Семейное положение] BIT;



INSERT INTO [dbo].[Страны] ([Наименование страны])
VALUES ('Россия'), ('Кыргызстан'), ('Казахстан')

INSERT INTO [dbo].[Города] ([Наименование города], [Код страны])
VALUES ('Бишкек', 2), ('Ош', 2),
  ('Москва', 1), ('Омск', 1), ('Томск', 1),
  ('Астана', 3), ('Шымкент', 3), ('Алмата', 3)

INSERT INTO [dbo].[Сотрудники] ([Отдел], [Фамилия], [Имя], [Отчество],
  [Дата рождения], [Зарплата], [Код города])
VALUES 
  (1, 'Петров', 'Игорь', 'Михайлович', '1987-03-25', 265, 1),
  (1, 'Петров', 'Юлий', 'Андреев', '1985-05-07', 255, 1),
  (1, 'Сашков', 'Юрий', 'Юриевич', '1990-12-13', 445, 1),
  (1, 'Иванов', 'Михаил', 'Александрович', '1992-07-14', 353, 2),
  (1, 'Недов', 'Александр', 'Анич', '1993-12-25', 323.0, 2),
  (2, 'Борисов', 'Адольф', 'Федосеевич', '1965-09-23', 254, 2),
  (2, 'Поляков', 'Архип', 'Митрофанович', '1965-11-17', 267, 2),
  (2, 'Фролов', 'Мстислав', 'Витальевич', '1966-05-10', 286, 2),
  (2, 'Сысоев', 'Клим', 'Семёнович', '1968-01-22', 323, 2),
  (2, 'Филиппов', 'Андрей', 'Пантелеймонович', '1968-10-01', 342, 2),
  (2, 'Гуляев', 'Гавриил', 'Викторович', '1969-04-04', 452, 2),
  (2, 'Авдеев', 'Аристарх', 'Георгиевич', '1970-12-08', 400, 2),
  (2, 'Власов', 'Бенедикт', 'Мэлсович', '1972-06-23', 300, 2),
  (2, 'Горшков', 'Руслан', 'Русланович', '1976-05-12', 454, 2),
  (2, 'Ковалёв', 'Ермолай', 'Русланович', '1980-01-28', 356, 2),
  (3, 'Крюков', 'Нинель', 'Созонович', '1980-08-11', 456, 1),
  (3, 'Дьячков', 'Богдан', 'Авксентьевич', '1984-07-10', 289, 1),
  (3, 'Николаев', 'Лукьян', 'Тимофеевич', '1986-01-03', 424, 1),
  (3, 'Николаев', 'Роман', 'Валерьевич', '1990-06-07', 255, 1),
  (3, 'Соболев', 'Тимур', 'Олегович', '1991-01-11', 450, 1),
  (3, 'Комиссаров', 'Альфред', 'Феликсович', '1992-08-03', 433, 1),
  (3, 'Матвеев', 'Владислав', 'Аркадьевич', '1998-04-23', 455, 1),
  (3, 'Лукин', 'Гаянэ', 'Борисович', '1998-08-04', 347, 1),
  (3, 'Родионов', 'Альберт', 'Мэлорович', '1999-10-28', 264, 1),
  (3, 'Федотов', 'Лукьян', 'Геласьевич', '2000-03-07', 250, 1)


ALTER TABLE [dbo].[Сотрудники]
  DROP CONSTRAINT [CHK_Сотрудники_Зарплата]
ALTER TABLE [dbo].[Сотрудники]
  ADD CONSTRAINT [CHK_Сотрудники_Зарплата] CHECK ([Зарплата] >= 200 AND [Зарплата] < 500)


-- уникальность сочетания полей
CREATE UNIQUE INDEX [IX_Сотрудники_ФИО_ДатаРождения]
ON [dbo].[Сотрудники] ([Фамилия], [Имя], [Отчество], [Дата рождения])


ALTER TABLE [dbo].[Сотрудники]
  ADD CONSTRAINT [CHK_Сотрудники_ДатаРождения] CHECK (YEAR(GETDATE()) - YEAR([Дата рождения]) <= 60)
----------------------------------------------------------------------------------------------------------------


-- DROP с условием, если нет вывести дату:
IF OBJECT_ID('dbo.Страны') IS NOT NULL
  DROP TABLE [dbo].[Страны];
ELSE
  SELECT GETDATE()


-- ОЧИСТКА
-- Переед очисткой надо сбросить foreign key.
ALTER TABLE [dbo].[Города]
  DROP CONSTRAINT [FK_Города_Страны]
-- Теперь можно.
TRUNCATE TABLE [dbo].[Страны]
-- Возвращаю ограничение.
ALTER TABLE [dbo].[Города]
  ADD CONSTRAINT [FK_Города_Страны] FOREIGN KEY ([Код страны])
    REFERENCES [dbo].[Страны] ([Код страны])
    ON DELETE CASCADE
    ON UPDATE CASCADE


-- UNIQUE KEY
ALTER TABLE [dbo].[Сотрудники]
  ADD CONSTRAINT [UQ_Сотрудники_ФИО_ДатаРождения] 
  UNIQUE ([Фамилия], [Имя], [Отчество], [Дата рождения])

-- UNIQUE INDEX
CREATE UNIQUE INDEX [IX_Сотрудники_ФИО_ДатаРождения]
ON [dbo].[Сотрудники] ([Фамилия], [Имя], [Отчество], [Дата рождения])

-- ВЫВОД
SELECT TOP (100) [Код города], [Наименование города], [Код страны]
FROM [krsuEdu_1].[dbo].[Города]